Tekla Open API Reference for Tekla Structures 2025
GuidConversion.GetNewGuid Method
Gets the new GUID.
 Namespace: Tekla.Structures.Model.Operations
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Guid GetNewGuid(
	Guid oldGuid
)
Public Function GetNewGuid (
	oldGuid As Guid
) As Guid
Parameters
oldGuid
Type: System.Guid
The old GUID.
Return Value
Type: Guid
The current GUID
See Also
Reference
GuidConversion Class
Tekla.Structures.Model.Operations Namespace